app/controllers/bars_controller.rb

SELECT "bars".* FROM "bars"
---
  def index
    @bars = Bar.all

INSERT INTO "bars" ("name", "description") VALUES ($1, $2) RETURNING "id"  [["name", "adfsadf"], ["description", "adsfadsfasdfadsf"]]
---
  def create
    @bar = Bar.new(bar_params)

    if @bar.save

SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @bar = Bar.find(params[:id])

SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @bar = Bar.find(params[:id])

SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "bars" SET "name" = $1, "description" = $2 WHERE "bars"."id" = $3  [["name", "Here we ho go"], ["description", "yayayya"], ["id", 2]]
---
  def update
  @bar = Bar.find(params[:id])
  if @bar.update_attributes(bar_params)

SELECT  "bars".* FROM "bars" WHERE "bars"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "bars" WHERE "bars"."id" = $1  [["id", 1]]
---
  def destroy
    @bar = Bar.find(params[:id])
    # @reviews = @bar.reviews
    if @bar.destroy!